#pragma once

#include <ntifs.h>

//*********************************************************************************
// 遍历注册表
//*********************************************************************************
SIZE_T GetRegList(PVOID InputBuff, PVOID OutputBuff);


//*********************************************************************************
// 删除指定注册表
//*********************************************************************************
NTSTATUS DeleteReg(PVOID InputBuff);

//*********************************************************************************
// 创建指定注册表子项
//*********************************************************************************
NTSTATUS CreateReg(PVOID InputBuff);


// 响应io 查询注册表信息
NTSTATUS OnArkQueryReg(PIRP pIrp);

// 响应io 查询注册表数量
NTSTATUS OnArkCountReg(PIRP pIrp);



